jphacks/F_2002/IoT/JPHacks/JPHacks.cydsn/Generated_Source/PSoC6/ADC_Photoresistor.h
#if(ADC_Photoresistor_TOTAL_CHANNELS_NUM > 1u)
    #define ADC_Photoresistor_CFG0_NEG_OTHER                 (uint16)((uint16)ADC_Photoresistor_SARMUX__VNEG0 << SAR_CTRL_NEG_SEL_Pos)
    #define ADC_Photoresistor_CFG0_SWITCH_CONF_INIT          0u
#else /* Disable SAR sequencer from enabling routing switches in single channel mode */
    #define ADC_Photoresistor_CFG0_SWITCH_CONF_INIT          SAR_CTRL_SWITCH_DISABLE_Msk
    #define ADC_Photoresistor_CFG0_NEG_OTHER                 0u
#endif /* ADC_Photoresistor_CFG0_CHANNEL_COUNT > 1u */

/* If the SAR is configured for multiple channels, always set SAR_HW_CTRL_NEGVREF to 1 */
#if(ADC_Photoresistor_TOTAL_CHANNELS_NUM == 1u)
    #define ADC_Photoresistor_CFG0_HW_CTRL_NEGVREF_INIT      0u
#else
    #define ADC_Photoresistor_CFG0_HW_CTRL_NEGVREF_INIT      SAR_CTRL_SAR_HW_CTRL_NEGVREF_Msk
#endif /* ADC_Photoresistor_CFG0_CHANNEL_COUNT == 1u */

#define ADC_Photoresistor_CFG0_POWER_INIT  (ADC_Photoresistor_PWR_CTRL_VREF_NORMAL_PWR)

/* SAMPLE_CTRL initial values */
#define ADC_Photoresistor_CFG0_SE_RESULT_FORMAT_INIT \
        (ADC_Photoresistor_CFG0_SINGLE_ENDED_FORMAT \
        << SAR_SAMPLE_CTRL_SINGLE_ENDED_SIGNED_Pos)

#define ADC_Photoresistor_CFG0_DIFF_RESULT_FORMAT_INIT \
        (ADC_Photoresistor_CFG0_DIFFERENTIAL_FORMAT \
        << SAR_SAMPLE_CTRL_DIFFERENTIAL_SIGNED_Pos)

#define ADC_Photoresistor_CFG0_AVG_SAMPLES_NUM_INIT \
        (ADC_Photoresistor_CFG0_SAMPLES_AVERAGED \
        << SAR_SAMPLE_CTRL_AVG_CNT_Pos)

/* Combination of Average Mode and Average Shift */
#define ADC_Photoresistor_CFG0_AVG_MODE_INIT \
        (ADC_Photoresistor_CFG0_AVGERAGING_MODE \
        << SAR_SAMPLE_CTRL_AVG_SHIFT_Pos)

#define ADC_Photoresistor_CFG0_TRIGGER_OUT_INIT      (0u)
#define ADC_Photoresistor_CFG0_UAB_SCAN_MODE_INIT    (0u)

#define ADC_Photoresistor_CFG0_VREF_POWER_INIT  \
        (ADC_Photoresistor_CFG0_VREF_PWR \
        << SAR_CTRL_PWR_CTRL_VREF_Pos)

#define ADC_Photoresistor_CFG0_COMP_PWR_INIT  \
        (ADC_Photoresistor_CFG0_COMP_PWR \
        << SAR_CTRL_COMP_PWR_Pos)

#define ADC_Photoresistor_CFG0_COMP_DLY_INIT  \
        (ADC_Photoresistor_CFG0_COMP_DLY \
        << SAR_CTRL_COMP_DLY_Pos)

#define ADC_Photoresistor_CFG0_CTRL_INIT  \
        (ADC_Photoresistor_CFG0_VREF_POWER_INIT \
        | ADC_Photoresistor_CFG0_VREF_SEL_MASK \
        | ADC_Photoresistor_CFG0_SE_NEG_INPUT_INIT \
        | ADC_Photoresistor_CFG0_HW_CTRL_NEGVREF_INIT \
        | ADC_Photoresistor_CFG0_COMP_DLY_INIT \
        | SAR_CTRL_REFBUF_EN_Msk \
        | ADC_Photoresistor_CFG0_COMP_PWR_INIT \
        | SAR_CTRL_DSI_SYNC_CONFIG_Msk  \
        | ADC_Photoresistor_CFG0_SWITCH_CONF_INIT )

#define ADC_Photoresistor_CFG0_SAMPLE_CTRL_INIT \
        (ADC_Photoresistor_CFG0_SE_RESULT_FORMAT_INIT \
        | ADC_Photoresistor_CFG0_DIFF_RESULT_FORMAT_INIT \
        | ADC_Photoresistor_CFG0_AVG_SAMPLES_NUM_INIT \
        | ADC_Photoresistor_CFG0_AVG_MODE_INIT \
        | ADC_Photoresistor_CFG0_DSI_TRIGGER_LEVEL_INIT \
        | ADC_Photoresistor_CFG0_DSI_TRIGGER_EN_INIT \
        | ADC_Photoresistor_CFG0_UAB_SCAN_MODE_INIT \
        | SAR_SAMPLE_CTRL_VALID_IGNORE_Msk \
        | ADC_Photoresistor_CFG0_TRIGGER_OUT_INIT \
        | SAR_SAMPLE_CTRL_EOS_DSI_OUT_EN_Msk \
)

#define ADC_Photoresistor_CFG0_RANGE_THRES_INIT \
        (ADC_Photoresistor_CFG0_LOW_LIMIT \
        | (uint32)((uint32)ADC_Photoresistor_CFG0_HIGH_LIMIT \
        << SAR_RANGE_THRES_RANGE_HIGH_Pos))

#define ADC_Photoresistor_CFG0_RANGE_COND_INIT   (cy_en_sar_range_detect_condition_t)ADC_Photoresistor_CFG0_RANGE_COND

/* Misc Config
    [0] - Freerunning: Set if the sample mode is freerunning
*/
#define ADC_Photoresistor_CFG0_MISC_CONFIG_INIT \
        (ADC_Photoresistor_CFG0_FREERUNNING)

/* ************************************************************************** */
/* End configuration 0 calculated defines                                     */
/* ************************************************************************** */

/* ************************************************************************** */
/* Begin configuration 1 calculated defines                                   */
/* ************************************************************************** */
#if(ADC_Photoresistor_TOTAL_CONFIGS > 1)
    #define ADC_Photoresistor_CFG1_SAMPLE_TIME01_INIT \
            ((ADC_Photoresistor_CFG1_APERTURE_TIME0 \
            << SAR_SAMPLE_TIME01_SAMPLE_TIME0_Pos) \
            | (ADC_Photoresistor_CFG1_APERTURE_TIME1 \
            << SAR_SAMPLE_TIME01_SAMPLE_TIME1_Pos))

    #define ADC_Photoresistor_CFG1_SAMPLE_TIME23_INIT \
            ((ADC_Photoresistor_CFG1_APERTURE_TIME2 \
            << SAR_SAMPLE_TIME23_SAMPLE_TIME2_Pos) \
            | (ADC_Photoresistor_CFG1_APERTURE_TIME3 \
            << SAR_SAMPLE_TIME23_SAMPLE_TIME3_Pos))

    /* Enable soc pin if used */
    #define ADC_Photoresistor_CFG1_DSI_TRIGGER_EN_INIT \
            (ADC_Photoresistor_CFG1_USE_SOC \
            << SAR_SAMPLE_CTRL_DSI_TRIGGER_EN_Pos)

    /* Set soc operation to edge or level based on sample mode */
    #if(ADC_Photoresistor_CFG1_FREERUNNING == ADC_Photoresistor_FREERUNNING)
        #define ADC_Photoresistor_CFG1_DSI_TRIGGER_LEVEL_INIT    (SAR_SAMPLE_CTRL_DSI_TRIGGER_LEVEL_Msk)
    #else /* Edge trigger */
        #define ADC_Photoresistor_CFG1_DSI_TRIGGER_LEVEL_INIT    (0u)
    #endif /* End ADC_Photoresistor_CFG1_FREERUNNING == ADC_Photoresistor_FREERUNNING */

    /* Set SE_NEG_INPUT */
    #if(ADC_Photoresistor_CFG1_VNEG_INPUT_SEL == ADC_Photoresistor_NEG_SEL_VSSA_KELVIN)
        #define ADC_Photoresistor_CFG1_SE_NEG_INPUT_INIT \
            ((uint32)(ADC_Photoresistor_NEG_SEL_VSSA_KELVIN \
            << SAR_CTRL_NEG_SEL_Pos ))
    #elif(ADC_Photoresistor_CFG1_VNEG_INPUT_SEL == ADC_Photoresistor_NEG_SEL_VREF)
        #define ADC_Photoresistor_CFG1_SE_NEG_INPUT_INIT     (ADC_Photoresistor_NEG_SEL_VREF \
                                                            << SAR_CTRL_NEG_SEL_Pos )
    #elif (ADC_Photoresistor_CFG1_SINGLE_PRESENT != 0u)
        #define ADC_Photoresistor_CFG1_SE_NEG_INPUT_INIT         ADC_Photoresistor_CFG1_NEG_OTHER
    #else
        #define ADC_Photoresistor_CFG1_SE_NEG_INPUT_INIT         0u
    #endif /* ADC_Photoresistor_CFG1_VNEG_INPUT_SEL == ADC_Photoresistor_NEG_SEL_VSSA_KELVIN */

    #define ADC_Photoresistor_CFG1_NEG_OTHER                 (uint16)((uint16)ADC_Photoresistor_SARMUX__VNEG1 << SAR_CTRL_NEG_SEL_Pos)
    #define ADC_Photoresistor_CFG1_SWITCH_CONF_INIT          0u

    /* If the SAR is configured for multiple channels, always set SAR_HW_CTRL_NEGVREF to 1 */
    #define ADC_Photoresistor_CFG1_HW_CTRL_NEGVREF_INIT      SAR_CTRL_SAR_HW_CTRL_NEGVREF_Msk

    #define ADC_Photoresistor_CFG1_POWER_INIT  (ADC_Photoresistor_PWR_CTRL_VREF_NORMAL_PWR)

    /* SAMPLE_CTRL initial values */
    #define ADC_Photoresistor_CFG1_SE_RESULT_FORMAT_INIT \
            (ADC_Photoresistor_CFG1_SINGLE_ENDED_FORMAT \
            << SAR_SAMPLE_CTRL_SINGLE_ENDED_SIGNED_Pos)

